In [1]:
# Libraries
import sys
sys.path.append('C:\Proyectos\Loteria\DataBase')
sys.path.append('C:\Proyectos\Loteria\DataAnalysis')
import datetime
import pandas as pd
import numpy as np
from scrapping import euro_scraping
from data_analisys import analisys
from clean_database import structure
# from collections import Counter
# from decimal import Decimal, ROUND_HALF_UP, getcontext
from itertools import combinations
# getcontext().prec = 5
# np.set_printoptions(precision=5)

In [2]:
db = pd.read_parquet('C:\Proyectos\Loteria\DataBase\db.parquet')
db_resultados = db.head(14)

In [3]:
db_resultados = db_resultados.rename(columns={'Sorteos': 'Sorteo'})

In [4]:
db_resultados

                 Dates  Sorteo  Nro1  Nro2  Nro3  Nro4  Nro5  Star_1  Star_2
0  2004-02-13 00:00:00       1    16    29    32    36    41       7       9
1  2004-02-20 00:00:00       2     7    13    39    47    50       2       5
2  2004-02-27 00:00:00       3    14    18    19    31    37       4       5
3  2004-03-05 00:00:00       4     4     7    33    37    39       1       5
4  2004-03-12 00:00:00       5    15    24    28    44    47       4       5
5  2004-03-19 00:00:00       6    33    36    37    42    45       4       9
6  2004-03-26 00:00:00       7     3     4    10    23    43       2       4
7  2004-04-02 01:00:00       8     4    12    24    27    36       2       9
8  2004-04-09 01:00:00       9     1     4    10    19    23       2       8
9  2004-04-16 01:00:00      10    14    15    28    35    40       1       3
10 2004-04-23 01:00:00      11     6    10    21    45    49       3       5
11 2004-04-30 01:00:00      12     5     6    16    23    27       6       7
12 2004-05-07 01:00:00      13    15    16    21    36    38       1       5
13 2004-05-14 01:00:00      14     1     3    21    32    39       2       6

In [5]:
new_draw = range(12, len(db)-1)
comprobations = []
recommended_numbers, not_recommended_numbers = analisys(db_resultados)
# db_resultados = pd.concat([db_resultados, db.loc[draw].to_frame().T], axis=0)

    year_criteria  rotation_criteria  group_criteria  position_criteria
1             0.0               1.00           0.675               0.50
2             0.0               0.25           0.675               1.00
3             0.0               1.00           0.675               0.50
4             0.0               1.00           0.675               1.00
5             0.0               0.25           0.675               0.65
6             0.0               1.00           0.675               0.65
7             0.0               1.00           0.675               0.55
8             0.0               0.25           0.675               1.00
9             0.0               0.25           0.675               1.00
10            0.0               1.00           0.675               1.00
11            0.0               0.25           0.700               1.00
12            0.0               0.25           0.700               0.75
13            0.0               0.25           0.700               0.75
14            0.0               1.00           0.700               0.45
15            0.0               1.00           0.700               0.45
16            0.0               1.00           0.700               0.45
17            0.0               0.25           0.700               1.00
18            0.0               0.25           0.700               1.00
19            0.0               1.00           0.700               1.00
20            0.0               0.25           0.700               1.00
21            0.0               1.00           0.625               0.50
22            0.0               0.25           0.625               1.00
23            0.0               1.00           0.625               0.65
24            0.0               1.00           0.625               0.75
25            0.0               0.25           0.625               1.00
26            0.0               0.25           0.625               1.00
27            0.0               1.00           0.625               0.65
28            0.0               1.00           0.625               0.45
29            0.0               0.25           0.625               1.00
30            0.0               0.25           0.625               1.00
31            0.0               0.25           0.700               1.00
32            0.0               1.00           0.700               0.50
33            0.0               1.00           0.700               1.00
34            0.0               0.25           0.700               1.00
35            0.0               0.25           0.700               0.45
36            0.0               1.00           0.700               0.45
37            0.0               1.00           0.700               1.00
38            0.0               0.25           0.700               0.45
39            0.0               1.00           0.700               0.50
40            0.0               0.25           0.700               0.45
41            0.0               0.25           1.000               1.00
42            0.0               0.25           1.000               1.00
43            0.0               0.25           1.000               0.75
44            0.0               0.25           1.000               0.65
45            0.0               1.00           1.000               1.00
46            0.0               0.25           1.000               1.00
47            0.0               1.00           1.000               0.65
48            0.0               0.25           1.000               1.00
49            0.0               0.25           1.000               1.00
50            0.0               0.25           1.000               0.75

C:\Proyectos\Loteria\DataAnalysis\data_analisys.py:129: RuntimeWarning: invalid value encountered in scalar divide
  y = round((1 - ((df_median[number] * 100) / df_average[number]) / 100), 2)

In [6]:
recommended_numbers

    evaluation
45       3.000
33       2.700
19       2.700
37       2.700
4        2.675
10       2.675
47       2.650
24       2.375
6        2.325
23       2.275
27       2.275
41       2.250
42       2.250
49       2.250
46       2.250
48       2.250
7        2.225
32       2.200
39       2.200
3        2.175
1        2.175
36       2.150
15       2.150
16       2.150
14       2.150

In [7]:
not_recommended_numbers

    evaluation
21       2.125
28       2.075
43       2.000
50       2.000
18       1.950
34       1.950
11       1.950
17       1.950
20       1.950
31       1.950
8        1.925
2        1.925
9        1.925
44       1.900
30       1.875
26       1.875
22       1.875
25       1.875
29       1.875
13       1.700
12       1.700
5        1.575
38       1.400
35       1.400
40       1.400